Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་གང་ལ་བསླབ་པར་བྱ་བའི་མ་རིག་པ་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་།
en: If you ask why, it is because they do not observe any ignorance in which they should train.

source: ལེན་པ་དང་། སྲིད་པ་དང་། སྐྱེ་བ་དང་རྒ་ཤི་ལ་མི་སློབ་སྟེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་གང་ལ་བསླབ་པར་བྱ་བའི་རྒ་ཤི་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: If you ask why, it is because they do not observe any aging and death [and so forth] in which they should train. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སློབ་པ་ནི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སློབ་སྟེ།
en: Bodhisattva great beings who train accordingly do not train in the perfection of generosity.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་གང་ལ་བསླབ་པར་བྱ་བའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: If you ask why, it is because they do not observe any perfection of generosity in which they should train.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སློབ་སྟེ།
en: They do not train in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་གང་ལ་བསླབ་པར་བྱ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: If you ask why, it is because they do not observe any perfection of wisdom [and so forth] in which they should train. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སློབ་པ་ནི། ནང་སྟོང་པ་ཉིད་ལ་མི་སློབ་སྟེ།
en: Bodhisattva great beings who train accordingly do not train in the emptiness of internal phenomena.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་གང་ལ་བསླབ་པར་བྱ་བའི་ནང་སྟོང་པ་ཉིད་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: If you ask why, it is because they do not observe any emptiness of internal phenomena in which they should train.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་མི་སློབ་སྟེ།
en: They do not train in the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་གང་ལ་བསླབ་པར་བྱ་བའི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: If you ask why, it is because they do not observe any emptiness of the essential nature of nonentities [and so forth] in which they should train. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སློབ་པ་ནི། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་མི་སློབ་སྟེ།
en: Bodhisattva great beings who train accordingly do not train in the applications of mindfulness.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་གང་ལ་བསླབ་པར་བྱ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་དེ་དག་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། ཡང་དག་པར་སྤོང་བ་དང་།
en: If you ask why, it is because they do not observe any applications of mindfulness in which they should train.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་མི་སློབ་སྟེ།
en: They do not train in the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་གང་ལ་བསླབ་པར་བྱ་བའི་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: If you ask why, it is because they do not observe any noble eightfold path [and so forth] in which they should train. “

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་།
en: Bodhisattva great beings who train accordingly do not train in the noble truths, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, or the distinct qualities of the buddhas.

source: མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་མི་སློབ་སྟེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་གང་ལ་བསླབ་པར་བྱ་བའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དེ་དག་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: If you ask why, it is because they do not observe any distinct qualities of the buddhas [and so forth] in which they should train.

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ཉིད་ལ་མི་སློབ།
en: They do not train in the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, or individual enlightenment.

source: ལམ་གྱི་རྣམ་པར་ཤེས་པ་ཉིད་ལ་མི་སློབ།
en: They do not train in knowledge of the path.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མི་སློབ་སྟེ།
en: They do not train in all-aspect omniscience.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་གང་ལ་བསླབ་པར་བྱ་བའི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: If you ask why, it is because they do not observe any all-aspect omniscience [and so forth] in which they should train.”

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། གནས་བརྟན་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཅིའི་ཕྱིར་ན། གཟུགས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: Then Śakra, mighty lord of the gods, asked the elder Subhūti, “Blessed Subhūti, why do bodhisattva great beings not observe physical forms?

source: ཅིའི་ཕྱིར་ན་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཅིའི་ཕྱིར་ན་སྐྱེ་མཆེད་དང་།
en: Why do they not observe feelings, perceptions, formative predispositions, or consciousness?

source: ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཅིའི་ཕྱིར་ན་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་།
en: Why do they not observe the sense fields, the sensory elements, or the links of dependent origination?

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཅིའི་ཕྱིར་ན་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: Why do they not observe the perfections, all the aspects of emptiness, or the thirty-seven factors conducive to enlightenment?

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: Why do they not observe the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, or the eighteen distinct qualities of the buddhas?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: Why do they not observe [the fruits and realizations], up to and including all-aspect omniscience?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་གཟུགས་གཟུགས་ཀྱིས་སྟོང་ངོ་།
en: Kauśika,” replied Subhūti, “it is because physical forms are empty of physical forms.

source: །ཚོར་བ་ཚོར་བས་སྟོང་ངོ་། འདུ་ཤེས་འདུ་ཤེས་ཀྱིས་སྟོང་ངོ་། འདུ་བྱེད་འདུ་བྱེད་ཀྱིས་སྟོང་ངོ་། རྣམ་པར་ཤེས་པ་རྣམ་པར་ཤེས་པས་སྟོང་ངོ་།
en: Feelings are empty of feelings, perceptions are empty of perceptions, formative predispositions are empty of formative predispositions, and consciousness is empty of consciousness. {

source: །སྐྱེ་མཆེད་དང་།
en: Ki.

source: ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བར་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བས་སྟོང་ངོ་། །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་།
en: II-IIII: 24} The sense fields, the sensory elements, and the links of dependent origination are empty of the links of dependent origination [and so forth].

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱིས་སྟོང་ངོ་།
en: The perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas and [all the fruits and realizations], up to and including all-aspect omniscience, are empty of all-aspect omniscience [and so forth]. “

source: །ཀཽ་ཤི་ཀ་གཟུགས་སྟོང་པ་ཉིད་ཀྱིས་གཟུགས་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Kauśika, the emptiness of physical forms does not observe the emptiness of physical forms.

source: །ཚོར་བ་སྟོང་པ་ཉིད་ཀྱིས་ཚོར་བ་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The emptiness of feelings does not observe the emptiness of feelings.

source: །འདུ་ཤེས་སྟོང་པ་ཉིད་ཀྱིས་འདུ་ཤེས་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The emptiness of perceptions does not observe the emptiness of perceptions.

source: །འདུ་བྱེད་སྟོང་པ་ཉིད་ཀྱིས་འདུ་བྱེད་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་ཀྱིས་རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The emptiness of formative predispositions does not observe the emptiness of formative predispositions, and the emptiness of consciousness does not observe the emptiness of consciousness.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་སྟོང་པ་ཉིད་ཀྱིས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: The emptiness of [all the attributes and fruits], up to and including all-aspect omniscience, does not observe all-aspect omniscience [and so forth]. “

source: །ཀཽ་ཤི་ཀ་དེ་ལྟར་གང་སྟོང་པ་ཉིད་འདི་ལ་སློབ་པ་དེ་ནི་གཉིས་སུ་མེད་པས་སྟོང་པ་ཉིད་ལ་སློབ་པ་སྟེ།
en: Kauśika, so it is that whoever trains in this emptiness trains in emptiness through there not being two.

source: དེ་གཉིས་སུ་བྱར་མེད་པར་གཟུགས་སྟོང་པ་ཉིད་ལ་སློབ་བོ།
en: That is to say, they train in the emptiness of physical forms without any dividing into two.

source: །དེ་གཉིས་སུ་བྱར་མེད་པར་ཚོར་བ་སྟོང་པ་ཉིད་དང་། འདུ་ཤེས་སྟོང་པ་ཉིད་དང་། འདུ་བྱེད་སྟོང་པ་ཉིད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་ལ་སློབ་བོ། །དེ་གཉིས་སུ་བྱར་མེད་པར་སྐྱེ་མཆེད་དང་།
en: They train in the emptiness of feelings, the emptiness of perceptions, the emptiness of perceptions, the emptiness of formative predispositions, and the emptiness of consciousness without any dividing into two.

source: ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་སྟོང་པ་ཉིད་ལ་སློབ་བོ། །དེ་གཉིས་སུ་བྱར་མེད་པར་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་།
en: They train in the emptiness of the sense fields, the sensory elements, and the links of dependent origination without any dividing into two.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་།
en: They train in the emptiness of the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, and of [all the fruits and realizations], up to and including all-aspect omniscience, without any dividing into two. “

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་སྟོང་པ་ཉིད་ལ་སློབ་བོ། །ཀཽ་ཤི་ཀ་གཟུགས་སྟོང་པ་ཉིད་ལ་གང་གཉིས་སུ་བྱར་མེད་པར་སློབ་པ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་ལ་གང་གཉིས་སུ་བྱར་མེད་པར་སློབ་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་སྟོང་པ་ཉིད་ལ་གང་གཉིས་སུ་བྱར་མེད་པར་སློབ་པ་དེ་ནི། གཉིས་སུ་བྱར་མེད་པར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སློབ་བོ། །དེ་གཉིས་སུ་བྱར་མེད་པར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Kauśika, those who train, without any dividing into two, in the emptiness of physical forms, and those who train, without any dividing into two, in the emptiness of feelings, perceptions, formative predispositions, and consciousness, train, without any dividing into two, in the perfection of generosity, and they train, without any dividing into two, in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སློབ་བོ། །དེ་ནི་གཉིས་སུ་བྱར་མེད་པར་ནང་སྟོང་པ་ཉིད་ལ་སློབ་བོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སློབ་བོ། །དེ་ནི་གཉིས་སུ་བྱར་མེད་པར་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་སློབ་བོ། །དེ་ནི་གཉིས་སུ་བྱར་མེད་པར་ཡང་དག་པར་སྤོང་བ་དང་།
en: They train, without any dividing into two, in the emptiness of internal phenomena, and they train, without any dividing into two, in the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སློབ་བོ། །དེ་ནི་གཉིས་སུ་བྱར་མེད་པར་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་།
en: They train, without any dividing into two, in the applications of mindfulness, and they train, without any dividing into two, in the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་སློབ་བོ། །དེ་ནི་གཉིས་སུ་བྱར་མེད་པར་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་།
en: They train, without any dividing into two, in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas.

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། སངས་རྒྱས་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་།
en: They train, without any dividing into two, in the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, buddhahood, knowledge of the path, and all-aspect omniscience. “

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་སློབ་བོ། །གཉིས་སུ་བྱར་མེད་པར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གང་སློབ་པ་དང་། གཉིས་སུ་བྱར་མེད་པར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གང་སློབ་པ་དང་། གཉིས་སུ་བྱར་མེད་པར་ནང་སྟོང་པ་ཉིད་ལ་གང་སློབ་པ་དང་། གཉིས་སུ་བྱར་མེད་པར་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་གང་སློབ་པ་དང་། གཉིས་སུ་བྱར་མེད་པར་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་གང་སློབ་པ་དང་གཉིས་སུ་བྱར་མེད་པར་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་ལ་གང་སློབ་པ་དང་། གཉིས་སུ་བྱར་མེད་པར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ལ་གང་སློབ་པ་དང་། གཉིས་སུ་བྱར་མེད་པར་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་གང་སློབ་པ་དང་། གཉིས་སུ་བྱར་མེད་པར་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་ལ་གང་སློབ་པ་དང་། གཉིས་སུ་བྱར་མེད་པར་རང་བྱང་ཆུབ་ལ་གང་སློབ་པ་དང་། གཉིས་སུ་བྱར་མེད་པར་སངས་རྒྱས་ཉིད་ལ་གང་སློབ་པ་དང་།
en: Those who train in the perfection of generosity without any dividing into two; those who train in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom without any dividing into two; those who train in the emptiness of internal phenomena without any dividing into two; those who train in the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, without any dividing into two; those who train in the applications of mindfulness without any dividing into two; those who train in the [other causal attributes], up to and including the noble eightfold path, without any dividing into two; those who train in the [fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, without any dividing into two; those who train in knowledge of all the dharmas without any dividing into two; and those who train in the [other fruits and realizations], up to and including all-aspect omniscience, without any dividing into two—all of them train in the incalculable and immeasurable attributes of the buddhas, without any dividing into two. “

source: གཉིས་སུ་བྱར་མེད་པར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་གང་སློབ་པ་དང་། གཉིས་སུ་བྱར་མེད་པར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་གང་སློབ་པ་དེ་ནི། གཉིས་སུ་བྱར་མེད་པར་སངས་རྒྱས་ཀྱི་ཆོས་གྲངས་མེད་ཚད་མེད་པ་ལ་སློབ་པོ། །གཉིས་སུ་བྱར་མེད་པར་སངས་རྒྱས་ཀྱི་ཆོས་གྲངས་མེད་ཚད་མེད་པ་ལ་གང་སློབ་པ་དེ་ནི། གཟུགས་འཕེལ་བར་བྱ་བ་དང་འགྲིབ་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ།
en: Those who train in the incalculable and immeasurable attributes of the buddhas, without any dividing into two, do not train in order to enhance or diminish physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་འཕེལ་བར་བྱ་བ་དང་འགྲིབ་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ།
en: They do not train in order to enhance or diminish feelings, perceptions, formative predispositions, or consciousness.

source: །སྐྱེ་མཆེད་དང་། ཁམས་འཕེལ་བར་བྱ་བ་དང་འགྲིབ་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ། །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་འཕེལ་བར་བྱ་བ་དང་འགྲིབ་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ།
en: They do not train in order to enhance or diminish the sense fields, the sensory elements, or the links of dependent origination. {

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་འཕེལ་བར་བྱ་བ་དང་འགྲིབ་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ།
en: Ki.II-IIII: 25} They do not train in order to enhance or diminish the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འཕེལ་བར་བྱ་བ་དང་འགྲིབ་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ།
en: They do not train in order to enhance or diminish the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: །ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་འཕེལ་བར་བྱ་བ་དང་འགྲིབ་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ།
en: They do not train in order to enhance or diminish the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of external and internal phenomena, or the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་འཕེལ་བར་བྱ་བ་དང་འགྲིབ་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: They do not train in order to enhance or diminish the applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་འཕེལ་བར་བྱ་བ་དང་འགྲིབ་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: They do not train in order to enhance or diminish the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་འཕེལ་བར་བྱ་བ་དང་འགྲིབ་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ།
en: They do not train in order to enhance or diminish the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge or the eighteen distinct qualities of the buddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་འཕེལ་བར་བྱ་བ་དང་འགྲིབ་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ། །དེ་ལྟར་གང་གཟུགས་འཕེལ་བར་བྱ་བ་དང་འགྲིབ་པར་བྱ་བའི་ཕྱིར་མི་སློབ་པ་དང་། ཚོར་བ་དང་།
en: They do not train in order to enhance or diminish [the fruits and realizations], up to and including all-aspect omniscience. “

source: འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་འཕེལ་བར་བྱ་བ་དང་འགྲིབ་པར་བྱ་བའི་ཕྱིར་མི་སློབ་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་འཕེལ་བར་བྱ་བ་དང་འགྲིབ་པར་བྱ་བའི་ཕྱིར་མི་སློབ་པ་དེ་ནི། གཟུགས་ཡོངས་སུ་གཟུང་བ་དང་། མེད་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ།
en: Those who do not train in order to enhance or diminish physical forms; who do not train in order to enhance or diminish feelings, perceptions, formative predispositions, or consciousness; and who do not train in order to enhance or diminish [all the attributes, fruits, and realizations], up to and including all-aspect omniscience, do not train in order to accept or negate physical forms.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་གཟུང་བ་དང་། མེད་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ།
en: They do not train in order to accept or negate feelings, perceptions, formative predispositions, or consciousness.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡོངས་སུ་གཟུང་བ་དང་། མེད་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ། །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་།
en: They do not train in order to accept or negate the sense fields, the sensory elements, or the links of dependent origination.
